src/Documents/Сделка/Сделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Сделка</name>
  <attributes>
    <name>Тикер</name>
    <type>
      <types>CatalogRef.АкцииETF</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСделки</name>
    <type>
      <types>EnumRef.ТипСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПолная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Сделка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьСуммы()
	Объект.Сумма = Объект.Цена * Объект.Количество;
	Объект.СуммаПолная = Объект.Сумма + Объект.Комиссия;	
КонецПроцедуры
#КонецОбласти
